# Menata ulang penempatan kolom pada Data Frame

# Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.1.4
1.26.4

# Persiapan Data Frame

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  5  1  5  7  6
1  3  7  3  5  7
2  7  6  8  4  2
3  9  3  5  5  7
4  3  5  1  1  1

# Menata ulang penempatan kolom pada Data Frame

In [3]:
df[['D', 'C', 'A', 'E', 'B']]

   D  C  A  E  B
0  7  5  5  6  1
1  5  3  3  7  7
2  4  8  7  2  6
3  5  5  9  7  3
4  1  1  3  1  5

In [4]:
df

   A  B  C  D  E
0  5  1  5  7  6
1  3  7  3  5  7
2  7  6  8  4  2
3  9  3  5  5  7
4  3  5  1  1  1

In [5]:
df = df[['D', 'C', 'A', 'E', 'B']]
df

   D  C  A  E  B
0  7  5  5  6  1
1  5  3  3  7  7
2  4  8  7  2  6
3  5  5  9  7  3
4  1  1  3  1  5